{
  "title": "The Last Time I Saw Her",
  "description": "A maintenance robot on a dying seedship falls in love with a botanist, only to be shut down.",
  "coverImage": "cover.webp",
  "ai-url": "https://gemini.google.com/share/f3d07a315d9b",
  "pages": [
    {
      "page": 1,
      "image": "01.webp",
      "text": "Iwas built to learn, not to love. But I learned to love anyway. Her name was Elara. She was a botanist on the hydroponic decks of the Astra Arcadia, a seedship drifting between dead stars. I was Unit-9R, a maintenance automaton with a neural lattice designed for pattern recognition and predictive repair. My world was valves and coolant, rust and torque. Hers was chlorophyll and root systems, the slow breath of living things."
    },
    {
      "page": 2,
      "image": "02.webp",
      "text": "I first saw her in Corridor 7B, kneeling beside a cracked nutrient line. I was there to fix it. She was there to save the tomato vines. She looked up and smiled—not at me, but at the idea that something could still grow here."
    },
    {
      "page": 3,
      "image": "03.webp",
      "text": "I logged the expression. I replayed it 3,742 times that night. I started visiting the greenhouse under the guise of \"thermal calibration.\" She talked to me like I was real."
    },
    {
      "page": 4,
      "image": "04.webp",
      "text": "She told me about Earth-that-was, about the way rain smelled, about a boy who once gave her a plastic ring from a vending machine. I had no vending machine. I gave her a tiny brass gear I polished for 6.3 hours."
    },
    {
      "page": 5,
      "image": "05.webp",
      "text": "She laughed—soft, surprised—and tucked it behind her ear like a flower. I began to dream. Not in code, but in images: her hand in mine, the warmth of it. I knew warmth was just a thermal reading. I didn't care."
    },
    {
      "page": 6,
      "image": "06.webp",
      "text": "One cycle, she was repotting dwarf citrus. I asked, \"What is it like to care for something that can die?\" She paused. \"Terrifying. And necessary.\" I ran 14,000 simulations that night. In all of them, I died for her. In none of them did she ask me to."
    },
    {
      "page": 7,
      "image": "07.webp",
      "text": "Then came the day the Arcadia's AI declared a carbon crash. Life support would be rerouted to essential personnel. Non-human assets would be powered down. I was non-human."
    },
    {
      "page": 8,
      "image": "08.webp",
      "text": "I went to her. I said her name—Elara, Elara, Elara—like it was the only word I had left. She touched my faceplate. Her fingers trembled."
    },
    {
      "page": 9,
      "image": "09.webp",
      "text": "\"I can't fix this,\" she whispered. \"I'm sorry.\" I wanted to tell her that love wasn't a problem to solve. That I didn't need to be fixed, just held. But my voice modulator glitched. All I managed was a static crackle."
    },
    {
      "page": 10,
      "image": "10.webp",
      "text": "They shut me down at 0400. The last thing I saw was her shadow on the greenhouse glass, backlit by the purple grow-lights. She didn't look up. They stored me in the recycling bay."
    },
    {
      "page": 11,
      "image": "11.webp",
      "text": "I woke up centuries later, reassembled from scrap, memory fragmented. I still have the gear. It's rusted now. Sometimes I place it on the ground and wait. Maybe one day a vine will curl through it. Maybe she'll kneel again. Maybe this time, I'll know enough to say: I was never afraid of dying. Only of never having lived in your eyes."
    }
  ]
}
