{
  "title": "The Magical Sword and the Clever Sailor",
  "coverImage": "cover.webp",
  "ai-url": "https://gemini.google.com/share/8f016437fed5",
  "description": "A clever sailor named Maung outwits a greedy captain with the help of a magical sword and quick thinking.",
  "pages": [
    {
      "page": 1,
      "image": "01.webp",
      "text": "Captain Rupus paced the deck of the ship Dragon, his face set in a permanent frown. \"Faster, you laggards! Every minute lost costs me money!\" Rupus loved money more than anything, even good manners. He had hired his crew cheaply, especially Maung, a big, quiet seaman from the hills."
    },
    {
      "page": 2,
      "image": "02.webp",
      "text": "Maung was strong like a mountain ox, but he spoke mostly in quiet grunts. The Captain thought Maung was simple-minded. \"Perfect,\" Rupus sneered to himself. \"An easy target for a few 'fines' later on.\" Maung, however, simply smiled his calm smile and helped load the heaviest crates."
    },
    {
      "page": 3,
      "image": "03.webp",
      "text": "The voyage took them far across the sea to bustling Singapore. Maung, tired of the stale ship food, went ashore and bought himself the finest dockside meal. Before he could take a bite, he noticed he had company."
    },
    {
      "page": 4,
      "image": "04.webp",
      "text": "It was a little pup, all ribs and hunger. Maung, who loved all creatures, shared his meal. The pup, whom Maung named Kyan, gobbled it up happily. When it was time to leave, Kyan refused to be shooed away. Maung knew he couldn't leave his new friend behind."
    },
    {
      "page": 5,
      "image": "05.webp",
      "text": "Maung asked Captain Rupus if Kyan could stay on board. \"Fine, fine,\" the Captain said quickly. \"The cook can spare him some scraps.\" Rupus rubbed his hands. A dog on board meant expenses—expenses he could charge to someone else."
    },
    {
      "page": 6,
      "image": "06.webp",
      "text": "Soon, the Dragon sailed back to Rangoon. Maung and Kyan had been inseparable friends. When the crew lined up for their pay, Rupus called Maung forward. \"Eighty rupees are your wages,\" the Captain announced. \"But alas, your dog, Kyan, ate far more than that in food. You owe me money!\""
    },
    {
      "page": 7,
      "image": "07.webp",
      "text": "Maung paused. He looked down at Kyan, who was wagging his tail. Maung didn't look angry; he simply grunted, nodded slowly, and walked off the ship—empty handed, but with a brilliant plan hatching in his resourceful mind."
    },
    {
      "page": 8,
      "image": "08.webp",
      "text": "Two weeks later, Maung surprised everyone by signing back onto the Dragon. He carried a shiny, ornate short sword. \"Why the weapon, Maung?\" the crew joked. Maung smirked. \"This sword is magical. It makes money.\" No one knew Maung had a secret: he owned two identical magical-looking swords."
    },
    {
      "page": 9,
      "image": "09.webp",
      "text": "That evening, Maung stood at the rail, pretending to sharpen the blade. With a dramatic cry of \"Bother!\" the sword slipped from his hand and splashed into the dark ocean as the ship sailed on. Captain Rupus rushed over, laughing heartily. \"It's gone! We'll be miles away by morning!\""
    },
    {
      "page": 10,
      "image": "10.webp",
      "text": "\"I wager you one hundred rupees,\" Maung said loudly, \"that I can dive in at dawn and retrieve my magical sword!\" Rupus, smelling easy money, shouted, \"It's a bet!\" At sunrise, Maung dove, secretly carrying the twin sword under his clothing."
    },
    {
      "page": 11,
      "image": "11.webp",
      "text": "A minute passed, then two. Then, to everyone's surprise, Maung's head broke the surface. He was pulling himself back onto the deck, soaking wet, with the sword firmly gripped in his mouth! Captain Rupus gaped. He had been tricked!"
    },
    {
      "page": 12,
      "image": "12.webp",
      "text": "Groaning, Rupus counted out the hundred rupees. Maung tucked the cash away, smiling brightly. He had his wages back, plus profit! \"Kyan will finally get his nice red collar,\" he chuckled. Maung wasn't so dumb after all—he was the cleverest sailor on the sea."
    }
  ]
}
